app/Controllers/Board.php

  public function list(): string
  {
    /*$db = db_connect();
    $sql = "SELECT * FROM board ORDER BY bid DESC";
    $result = $db->query($sql);
    $data['list'] = $result -> getResult(); //조회결과를 변수명 data에 할당
    */
    $boardModel = new BoardModel();
    $page = $this->request->getVar('page') ?? 1;
    $perPage = 10;
    $startLimit = ($page-1) * $perPage;

    $query = $boardModel -> select('board.*')
      ->where('1=1')
      ->orderBy('bid','desc')
      ->limit($perPage,$startLimit)
      ->findAll($perPage,$startLimit);
---
SELECT `board`.*
FROM `board`
WHERE 1 = 1
ORDER BY `bid` DESC
 LIMIT 10